export default {
  'id': '303',
  'name': 'UML-序列',
  'code': 'uml-sequence',
  'desc': 'UML2.0中的序列图',
  'orderNo': 303,
  'subject': 'uml',
  //当前分组下所有控件
  'controls': [
    {
      'id': '303001',
      'name': '对象生命线',
    },
    {
      'id': '303002',
      'name': '生命线',

    },
    {
      'id': '303003',
      'name': '序列对象',
    },
    {
      'id': '303004',
      'name': '激活',
    },
    {
      'id': '303005',
      'name': '激活中断',
    },
    {
      'id': '303006',
      'name': '包',
    },
    {
      'id': '303007',
      'name': '替代片段',
    },
    {
      'id': '303008',
      'name': '循环片段',
    },
    {
      'id': '303009',
      'name': '抉择片段',
    },
    {
      'id': '303010',
      'name': '选项片段',
    },
    {
      'id': '303011',
      'name': '并行片段',
    },
    {
      'id': '303012',
      'name': '自定义片段',
    },
    {
      'id': '303013',
      'name': '对象删除',
    },
    {
      'id': '303014',
      'name': '角色',
    },
    {
      'id': '303015',
      'name': '角色生命线',
    },
    {
      'id': '303016',
      'name': '实体',
    },
    {
      'id': '303017',
      'name': '边界',
    },
    {
      'id': '303018',
      'name': '控制',
    },
    {
      'id': '307011',
      'name': '约束',
    },
    {
      'id': '102090',
      'name': '终点',
    },
    {
      'id': '103005',
      'name': '注释',
    },
    {
      'id': '303019',
      'name': '调用',
    },
    {
      'id': '303020',
      'name': '过渡',
    },
    {
      'id': '303021',
      'name': '异步消息',
    }
  ]

}
