export default {
  'id': '304',
  'name': 'UML-部署',
  'code': 'uml-deploy',
  'desc': 'UML2.0中的部署图',
  'orderNo': 304,
  'subject': 'uml',
  //当前分组下所有控件
  'controls': [
    {
      'id': '307012',
      'name': '包',
    },
    {
      'id': '308005',
      'name': '对象',

    },
    {
      'id': '304003',
      'name': '对象',
    },
    {
      'id': '304004',
      'name': '组件',
    },
    {
      'id': '304005',
      'name': '组件实例',
    },
    {
      'id': '304006',
      'name': '组件',
    },
    {
      'id': '304007',
      'name': '组件实例',
    },
    {
      'id': '304008',
      'name': '项目',
    },
    {
      'id': '304009',
      'name': '项目实例',
    },
    {
      'id': '304010',
      'name': '节点',
    },
    {
      'id': '304011',
      'name': '节点实例',
    },
    {
      'id': '304012',
      'name': '节点实例',
    },
    {
      'id': '304013',
      'name': '部署描述',
    },
    {
      'id': '304014',
      'name': '部署描述',
    },
    {
      'id': '307011',
      'name': '约束',
    },
    {
      'id': '103005',
      'name': '注释',
    },
    {
      'id': '304017',
      'name': '示意图',
    },
    {
      'id': '304018',
      'name': '通信',
    },
    {
      'id': '304019',
      'name': '继承',
    },
    {
      'id': '304020',
      'name': '依赖',
    },
    {
      'id': '304021',
      'name': '聚合',
    },
    {
      'id': '304022',
      'name': '表明',
    },
    {
      'id': '304023',
      'name': '部署',
    }
  ]

}
