export default {
  'id': '307',
  'name': 'UML-类图',
  'code': 'uml-class',
  'desc': 'UML2.0中的类图',
  'orderNo': 307,
  'subject': 'uml',
  //当前分组下所有控件
  'controls': [
    {
      'id': '307001',
      'name': '类',
    },
    {
      'id': '307002',
      'name': '简单类',

    },
    {
      'id': '307003',
      'name': '活动类',
    },
    {
      'id': '307004',
      'name': '接口',
    },
    {
      'id': '307005',
      'name': '简单界面',
    },
    {
      'id': '307006',
      'name': '多重',
    },
    {
      'id': '307007',
      'name': '枚举',
    },
    {
      'id': '307008',
      'name': '数据类型',
    },
    {
      'id': '307009',
      'name': '信号',
    },
    {
      'id': '307010',
      'name': '原始的',
    },
    {
      'id': '307011',
      'name': '约束',
    },
    {
      'id': '307012',
      'name': '包',
    },
    {
      'id': '307013',
      'name': '概述',
    },
    {
      'id': '307014',
      'name': '模型',
    },
    {
      'id': '307015',
      'name': '包装容器',
    },
    {
      'id': '307016',
      'name': '对象',
    },
    {
      'id': '103005',
      'name': '注释',
    },
    {
      'id': '307018',
      'name': '关联',
    },

    {
      'id': '307019',
      'name': '泛化',
    },
    {
      'id': '307020',
      'name': '实现',
    },
    {
      'id': '305017',
      'name': '聚合',
    },
    {
      'id': '305018',
      'name': '组合',
    },
    {
      'id': '305016',
      'name': '依赖',
    },
    {
      'id': '307024',
      'name': '关联',
    },
    {
      'id': '305014',
      'name': '链接',
    },
  ]

}
