export default {
  'id': '308',
  'name': 'UML-活动',
  'code': 'uml-active',
  'desc': 'UML2.0中的活动图',
  'subject': 'uml',
  'orderNo': 308,
  //当前分组下所有控件
  'controls': [
    {
      'id': '308001',
      'name': '活动',
    },
    {
      'id': '301001',
      'name': '状态',
    },
    {
      'id': '301002',
      'name': '状态',
    },
    {
      'id': '308004',
      'name': '状态',
    },
    {
      'id': '308005',
      'name': '对象',
    },
    {
      'id': '308006',
      'name': '水平交叉',
    },
    {
      'id': '308007',
      'name': '垂直交叉',
    },
    {
      'id': '308008',
      'name': '发送信号',
    },
    {
      'id': '308009',
      'name': '接收信号',
    },
    {
      'id': '308010',
      'name': '暂停',
    },
    {
      'id': '308011',
      'name': '接收事件',
    },
    {
      'id': '308012',
      'name': '点',
    },
    {
      'id': '103005',
      'name': '注释',
    },
    {
      'id': '308014',
      'name': '状态容器',
    },
    
    {
      'id': '308016',
      'name': '水平泳道',
    },
    {
      'id': '308017',
      'name': '垂直泳道',
    },
    {
      'id': '308018',
      'name': '矩阵',
    },

    {
      'id': '308019',
      'name': '控制流',
    },
    {
      'id': '308020',
      'name': '控制流',
    },
    {
      'id': '102001',
      'name': '初始节点',
    },
    {
      'id': '102093',
      'name': '终止节点',
    },
    {
      'id': '308023',
      'name': '分叉节点',
    }
  ]

}
