export default {
  'id': '301',
  'name': 'UML-状态图',
  'code': 'uml-state',
  'desc': 'UML2.0中的状态图',
  'orderNo': 301,
  'subject': 'uml',
  //当前分组下所有控件
  'controls': [
    {
      'id': '301001',
      'name': '状态',

    },
    {
      'id': '301002',
      'name': '子状态机',

    },
    {
      'id': '301003',
      'name': '复合状态',

    },
    {
      'id': '102001',
      'name': '初始状态',

    },
    {
      'id': '102091',
      'name': '最终状态',

    },
    {
      'id': '301006',
      'name': '流终',

    },
    {
      'id': '301007',
      'name': '判定',

    },
    {
      'id': '301008',
      'name': '简略历史',

    },
    {
      'id': '301009',
      'name': '详细历史',

    },
    {
      'id': '301010',
      'name': '约束',

    },
    {
      'id': '103005',
      'name': '注释',
    },
    {
      'id': '301012',
      'name': '分叉',
    },
    {
      'id': '301013',
      'name': '汇聚',
    },
    {
      'id': '301014',
      'name': '转换',
    }
  ]
}
