export default {
  'id': '302',
  'name': 'UML-用例',
  'code': 'uml-case',
  'desc': 'UML2.0中的用例图',
  'orderNo': 302,
  'subject': 'uml',
  //当前分组下所有控件
  'controls': [
    {
      'id': '103006',
      'name': '角色',
    },
    {
      'id': '302002',
      'name': '用例',
    },
    {
      'id': '302006',
      'name': '扩展用例',
    },
    {
      'id': '302007',
      'name': '扩展用例',
    },
    // {
    //   'id': '302003',
    //   'name': '系统',
    // },
    {
      'id': '302004',
      'name': '参与者',
    },
    {
      'id': '302005',
      'name': '协作',
    },
    {
      'id': '103005',
      'name': '注释',
    },
    {
      'id': '302010',
      'name': '协会',
    },
    {
      'id': '307019',
      'name': '泛化',
    },
    {
      'id': '302012',
      'name': '包含',
    },
    {
      'id': '302013',
      'name': '扩展',
    },
    {
      'id': '302014',
      'name': '接口',
    },

  ]

}
