export default {
  'id': '304',
  'name': 'ddei.uml.groups.deploy',
  'code': 'uml-deploy',
  'desc': 'UML2.0中的部署图',
  'orderNo': 304,
  'subject': 'uml',
  //当前分组下所有控件
  'controls': [
    {
      'id': '307012',
    },
    {
      'id': '308005',
    },
    {
      'id': '304003',
    },
    {
      'id': '304004',
    },
    {
      'id': '304005',
    },
    {
      'id': '304006',
    },
    {
      'id': '304007',
    },
    {
      'id': '304008',
    },
    {
      'id': '304009',
      'name': 'ddei.uml.projins',
    },
    {
      'id': '304010',
    },
    {
      'id': '304011',
    },
    {
      'id': '304012',
      'name': 'ddei.uml.nodeins',
    },
    {
      'id': '304013',
    },
    {
      'id': '304014',
    },
    {
      'id': '307011',
    },
    {
      'id': '103005',
    },
    {
      'id': '304017',
      'name': 'ddei.uml.sketchmap',
    },
    {
      'id': '304018',
    },
    {
      'id': '304019',
    },
    {
      'id': '304020',
    },
    {
      'id': '304021',
    },
    {
      'id': '304022',
    },
    {
      'id': '304023',
    }
  ]

}
